app/views/employees/index.html.erb

SELECT "profiles".* FROM "profiles" WHERE "profiles"."employee_id" = ? AND "profiles"."deleted_at" IS NULL ORDER BY "profiles"."id" ASC LIMIT ?  [["employee_id", 1], ["LIMIT", 1]]
---
        <tr class="employee">
          <% if employee.profiles.active.present? %>

SELECT "profiles".* FROM "profiles" WHERE "profiles"."employee_id" = ? AND "profiles"."deleted_at" IS NULL  [["employee_id", 3]]
---
            <% else %>
              <td><%= link_to employee.number, employee_profile_path(employee, employee.profiles.active.first) %></td>