app/controllers/dashboard_controller.rb

SELECT "articles".* FROM "articles" ORDER BY "articles"."created_at" DESC LIMIT ?  [["LIMIT", 1]]
---
  def index
    @articles=Article.all.order(created_at:"desc")
    if @articles.first.created_at > @articles.last.created_at

INSERT INTO "articles" ("title", "content", "author", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "a"], ["content", "a"], ["author", 1], ["created_at", "2022-12-12 03:14:49.533579"], ["updated_at", "2022-12-12 03:14:49.533579"]]
---
  def create
    @article=Article.new(title:params[:title],content:params[:content],author:session[:user_id])
    if @article.save

SELECT "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 29], ["LIMIT", 1]]
---
  def show
    @article=Article.find_by(id:params[:id])

SELECT "articles".* FROM "articles" ORDER BY "articles"."created_at" DESC
---
  def sort
    @articles=Article.all.order(created_at: params[:sort])

SELECT "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 19], ["LIMIT", 1]]
DELETE FROM "articles" WHERE "articles"."id" = ?  [["id", 19]]
---
  def destroy
    @article=Article.find_by(id: params[:id])
    @article.destroy

SELECT "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 17], ["LIMIT", 1]]
---
  def edit
    @article=Article.find_by(id: params[:id])

SELECT "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 18], ["LIMIT", 1]]
UPDATE "articles" SET "title" = ?, "content" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["title", "ab"], ["content", "ac"], ["updated_at", "2022-12-12 03:59:21.899093"], ["id", 17]]
---
  def update
    @article=Article.find_by(id: params[:id])
    @article.content=params[:content]
    @article.title=params[:title]
    if @article.save