app/controllers/dashboard_controller.rb

  def set_employee
    @employee = Employee.find(params["id"])
---
SELECT "employees".* FROM "employees" WHERE "employees"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]