app/controllers/employees_controller.rb

  def index
    @employees = Employee.active.order("#{sort_column} #{sort_direction}")
---
SELECT "employees".* FROM "employees" WHERE "employees"."deleted_at" IS NULL ORDER BY department_id desc

  def create
    @employee = Employee.new(employee_params)

    if @employee.save
---
INSERT INTO "employees" ("department_id", "office_id", "number", "last_name", "first_name", "account", "password", "email", "date_of_joining", "created_at", "updated_at", "news_posting_auth") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

  def update
    if @employee.update(employee_params)
---
UPDATE "employees" SET "updated_at" = ?, "news_posting_auth" = ? WHERE "employees"."id" = ?  [["updated_at", "2022-12-10 02:10:02.510967"], ["news_posting_auth", 1], ["id", 2]]

  def destroy
    ActiveRecord::Base.transaction do
      now = Time.now
      @employee.update_column(:deleted_at, now)
      @employee.profiles.active.first.update_column(:deleted_at, now) if @employee.profiles.active.present?
    end

    redirect_to employees_url, notice: "社員「#{@employee.last_name} #{@employee.first_name}」を削除しました。"
---
UPDATE "employees" SET "deleted_at" = ? WHERE "employees"."id" = ?  [["deleted_at", "2022-12-12 01:11:01.324833"], ["id", 3]]
SELECT "profiles".* FROM "profiles" WHERE "profiles"."employee_id" = ? AND "profiles"."deleted_at" IS NULL  [["employee_id", 3]]

  def set_employee
    @employee = Employee.find(params['id'])
---
SELECT "employees".* FROM "employees" WHERE "employees"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def set_form_option
    @departments = Department.all
    @offices = Office.all
---
SELECT "departments".* FROM "departments"
SELECT "offices".* FROM "offices"