app/controllers/profiles_controller.rb

  def create
    @profile = Profile.new(profile_params)

    if @profile.save
---
INSERT INTO "profiles" ("employee_id", "profile", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["employee_id", 1], ["profile", "私は山田です"], ["created_at", "2022-12-07 11:37:56.920815"], ["updated_at", "2022-12-07 11:37:56.920815"]]

  def update
    if @profile.update(profile_params)
---
UPDATE "profiles" SET "profile" = ?, "updated_at" = ? WHERE "profiles"."id" = ?

    def set_employee
      @employee = Employee.find(params["employee_id"])
---
SELECT "employees".* FROM "employees" WHERE "employees"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

    def set_profile
      @profile = @employee.profiles.active.first
---
SELECT "profiles".* FROM "profiles" WHERE "profiles"."employee_id" = ? AND "profiles"."deleted_at" IS NULL ORDER BY "profiles"."id" ASC LIMIT ?  [["employee_id", 1], ["LIMIT", 1]]