app/controllers/sessions_controller.rb

SELECT "employees".* FROM "employees" WHERE "employees"."account" = ? AND "employees"."password" = ? LIMIT ?  [["account", "yamada"], ["password", "hogehoge"], ["LIMIT", 1]]
---
  def create
    if check_params
      employee = Employee.find_by(account: employee_params[:account], password: employee_params[:password])